# Сложение/вычитание: даны x=123 и y=57 — выведи сумму и разность.

x = 123
y = 57
print(x -y)
print(x+y)

# Умножение/деление: даны a=12, b=5 — выведи a*b и a/b (объясни тип результата).
a = 12
b = 5
print(a * b)
print(a / b)

# Целочисленное деление и остаток: для a=37, b=8 выведи a//b и a%b.

a = 37
b = 8
print(a//b)
print(a % b)

# Возведение в степень: вычисли 3**7 и выведи результат.

a = 3
b = 7
c = 3 ** 7
print(c)

# Комбинация операций: вычисли выражение (12 + 5*3) // 4 и объясни порядок операций.
print((12 + 5*3) // 4)